{
  "login": "Đăng nhập",
  "email": "Email",
  "search": "Tìm kiếm",
  "explore": "Khám phá",
  "popularCourseSectionTitle": "Khóa Học Phổ Biến",
  "popularCareerSectionTitle": "Nghề Nghiệp Phổ Biến",
  "popularProgramSectionTitle": "Chương Trình Học Phổ Biến",
  "Sign out": "Đăng xuất",
  "goals": "Mục tiêu nghề nghiệp",
  "topics": "Chủ đề học",
  "moreGoals": "Thêm mục tiêu nghề nghiệp",
  "moreTopics": "Tìm hiểu thêm chủ đề học",
  "Course search": "Tìm kiếm khóa học",
  "Rating": "Đánh giá",
  "related courses": "khóa học liên quan",
  "Duration": "Thời lượng",
  "Long (over 1 month)": "Dài (trên 1 tháng)",
  "Medium (1-4 weeks)": "Trung bình (1-4 tuần)",
  "Short (less than 1 week)": "Ngắn (ít hơn 1 tuần)",
  "All": "Tất cả",
  "Advanced filters": "Bộ lọc nâng cao",
  "Careers": "Nghề nghiệp",
  "Career": "Nghề nghiệp",
  "Tool": "Công cụ",
  "Framework": "Khung phần mềm",
  "Knowledge": "Kiến thức nền",
  "Platform": "Nền tảng",
  "Programming language": "Ngôn ngữ lập trình",
  "Website": "Trang web",
  "Skills": "Kỹ năng",
  "You have no recommendation at the moment!": "Bạn hiện không có lộ trình học được gợi ý nào!",
  "Back to profile": "Quay lại hồ sơ cá nhân",
  "Create recommendation": "Tạo lộ trình học",
  "We are generating your recommendation! Please wait for a moment!": "Chúng tôi đang tạo lộ trình học cho bạn! Vui lòng đợi một chút!",
  "Explore": "Khám phá\n",
  "online courses": "khóa học trực tuyến",
  "with your career goal": "\ntheo mục tiêu của bạn",
  "GET YOUR RECOMMENDATIONS NOW!": "Xem gợi ý cho riêng bạn!",
  "Recommended for you": "Khóa học đề xuất",
  "More": "Thêm",
  "Your courses": "Xem khóa học đã lưu",
  "Profile": "Hồ sơ",
  "Admin": "Quản trị viên",
  "Learning path filter": "Lọc lộ trình học",
  "Number of courses": "Số lượng khóa học",
  "Total cost": "Tổng chi phí",
  "Select learning path": "Chọn lộ trình học",
  "Total time": "Tổng thời gian",
  "Path": "Lộ trình",
  "courses": "khóa học",
  "hours": "giờ",
  "Courses by order": "Danh sách khóa học cần học theo thứ tự ",
  "Courses without order": "Danh sách các khóa học không cần học theo thứ tự",
  "Do you really want to delete current recommendation?": "Bạn có thực sự muốn xóa lộ trình học hiện tại?",
  "Delete": "Xóa",
  "LPS_Details": "Chi tiết",
  "Recommendation details": "Chi tiết gợi ý lộ trình học",
  "Skills needed": "Các kỹ năng cần thiết",
  "Skills known": "Các kỹ năng đã biết",
  "Career detail": "Chi tiết nghề nghiệp",
  "Overview": "Tổng quan",
  "careerDescriptions": {
    "Backend Developer": "Một nhà phát triển backend chuyên về việc tạo logic phía máy chủ của các ứng dụng web, cơ sở dữ liệu và APIs. Họ thành thạo trong các ngôn ngữ lập trình như Python, Java, Ruby hoặc Node.js, và có kỹ năng làm việc với các framework như Django, Flask, Spring Boot hoặc Express.",
    "Business Analyst": "Một nhà phân tích kinh doanh phân tích các quy trình kinh doanh và hệ thống của tổ chức để xác định các lĩnh vực cần cải thiện và tối ưu hóa. Họ thu thập yêu cầu, tạo tài liệu và thường hoạt động như một liên kết giữa các bên liên quan trong kinh doanh và các nhóm kỹ thuật.",
    "Data Analysts": "Các nhà phân tích dữ liệu thu thập, xử lý và phân tích dữ liệu để cung cấp thông tin và hỗ trợ quyết định trong một tổ chức. Họ sử dụng các kỹ thuật thống kê, các công cụ trực quan hóa dữ liệu và các ngôn ngữ lập trình như SQL, Python hoặc R để làm việc với các tập dữ liệu.",
    "Data Engineer": "Các kỹ sư dữ liệu thiết kế, xây dựng và duy trì cơ sở hạ tầng và kiến trúc cần thiết cho việc tạo ra, lưu trữ và phân tích dữ liệu. Họ làm việc với các công nghệ dữ liệu lớn, cơ sở dữ liệu và các đường ống dữ liệu, đảm bảo chất lượng, độ tin cậy và khả năng mở rộng của dữ liệu.",
    "Data Scientist": "Các nhà khoa học dữ liệu sử dụng các kỹ năng phân tích, thống kê và lập trình tiên tiến để trích xuất thông tin và kiến thức từ các tập dữ liệu lớn. Họ phát triển các mô hình học máy, thực hiện khai thác dữ liệu và truyền đạt các phát hiện cho các bên liên quan để hỗ trợ quyết định kinh doanh.",
    "Database Administrator": "Một quản trị cơ sở dữ liệu quản lý và duy trì cơ sở dữ liệu của một tổ chức để đảm bảo hoạt động một cách hiệu quả, an toàn và đáng tin cậy. Họ xử lý các nhiệm vụ như thiết kế cơ sở dữ liệu, cài đặt, cấu hình, sao lưu, phục hồi và điều chỉnh hiệu suất.",
    "Devops Engineer": "Một kỹ sư DevOps kết hợp vai trò phát triển và vận hành để tối ưu hóa quy trình giao phần mềm và cải thiện sự hợp tác giữa các nhóm. Họ tự động hóa triển khai cơ sở hạ tầng, theo dõi hiệu suất hệ thống và triển khai các đường ống tích hợp liên tục và giao phần mềm.",
    "Frontend Developer": "Một nhà phát triển frontend chuyên về việc tạo giao diện người dùng và các yếu tố tương tác của trang web và ứng dụng web. Họ thành thạo trong HTML, CSS và JavaScript, và thường làm việc với các framework frontend như React, Angular hoặc Vue.js.",
    "Game Development": "Các nhà phát triển game thiết kế, phát triển và duy trì trò chơi video cho các nền tảng khác nhau như máy chơi game, PC và thiết bị di động. Họ hợp tác với các nghệ sĩ, nhà thiết kế và lập trình viên để tạo cơ chế trò chơi, đồ họa và hiệu ứng âm thanh hình ảnh.",
    "Mobile Developer": "Một nhà phát triển di động tạo ứng dụng cho các thiết bị di động như điện thoại thông minh và máy tính bảng. Họ thành thạo trong các framework và ngôn ngữ phát triển di động như Swift hoặc Objective-C cho iOS, và Kotlin hoặc Java cho Android.",
    "Network Engineer": "Một kỹ sư mạng thiết kế, triển khai và duy trì các mạng máy tính của một tổ chức, bao gồm mạng cục bộ (LAN), mạng rộng (WAN) và mạng nội bộ. Họ đảm bảo an ninh, độ tin cậy và hiệu suất của mạng.",
    "Software Architect": "Một kiến trúc sư phần mềm thiết kế cấu trúc tổng thể của các hệ thống và ứng dụng phần mềm để đáp ứng yêu cầu kỹ thuật và kinh doanh. Họ đưa ra các quyết định thiết kế cấp cao, xác định các tiêu chuẩn mã hóa và đảm bảo tính toàn vẹn kiến trúc và khả năng mở rộng.",
    "Tester": "Các nhà kiểm thử đánh giá ứng dụng phần mềm để xác định các lỗi, vấn đề và không đồng nhất trước khi chúng được phát hành vào sản xuất. Họ thiết kế và thực thi các trường hợp kiểm thử, báo cáo các lỗi và làm việc chặt chẽ với các nhà phát triển để đảm bảo chất lượng phần mềm.",
    "UX/UI Designer": "Các nhà thiết kế UX/UI tạo giao diện người dùng và trải nghiệm người dùng cho ứng dụng web và di động. Họ nghiên cứu, thiết kế và thử nghiệm các phương pháp tốt nhất để tối ưu hóa sự tương tác và trải nghiệm người dùng."
  },
  "Programming Language": "Ngôn ngữ lập trình",
  "Tools": "Công cụ",
  "Your favorite courses": "Khóa học yêu thích của bạn",
  "Total": "Tổng cộng",
  "Your learning courses": "Khóa học bạn đang học",
  "Your completed courses": "Khóa học bạn đã hoàn thành",
  "Edit Profile": "Chỉnh sửa hồ sơ",
  "My careers": "Nghề nghiệp",
  "Goal career": "Mục tiêu nghề nghiệp",
  "Current careers": "Nghề nghiệp hiện tại",
  "My courses": "Xem khóa học đã lưu",
  "My learning path": "Xem lộ trình học",
  "Update user information": "Cập nhật thông tin người dùng",
  "Update new picture": "Cập nhật hình ảnh mới",
  "Save Profile": "Lưu thông tin",
  "User name": "Tên tài khoản",
  "First name": "Tên",
  "Last name": "Họ và tên lót",
  "Go to course": "Đến trang khóa học",
  "Mark as learning": "Đánh dấu đang học",
  "Complete this course": "Đánh dấu đã hoàn thành",
  "Mark as stop learning": "Đánh dấu dừng học",
  "Learn again": "Học lại",
  "Similar courses": "Các khóa học tương tự",
  "Fee": "Chi phí",
  "fee": "Chi phí",
  "Free": "Miễn phí",
  "Add to favorite": "Thêm vào yêu thích",
  "Remove favorite": "Xóa khỏi yêu thích",
  "Completed": "Đã hoàn thành",
  "Learning": "Đang học",
  "You must complete your information before using our service!": "Bạn hoàn thiện thông tin cá nhân trước khi sử dụng ứng dụng nhé!",
  "Is there any career that you want to earn?": "Bạn có mục tiêu nghề nghiệp nào muốn đạt được không?",
  "Back": "Quay lại",
  "Next": "Tiếp theo",
  "Skip": "Bỏ qua",
  "Complete your personal information": "Hoàn thiện thông tin cá nhân",
  "Your goal career": "Mục tiêu nghề nghiệp của bạn",
  "Your skills": "Kỹ năng của bạn",
  "Complete": "Hoàn tất",
  "Username": "Tên tài khoản",
  "Last Name": "Họ và tên lót",
  "First Name": "Tên",
  "Start using": "Bắt đầu sử dụng",
  "Thank you for your registration, let's get started!": "Cảm ơn bạn đã đăng ký, bắt đầu sử dụng ứng dụng ngay thôi!",
  "Recommend courses": "Gợi ý khóa học",
  "User guide": "Hướng dẫn sử dụng",
  "Let's take a look about our website": "Hãy cùng tìm hiểu về ứng dụng của chúng tôi",
  "Navigation bar and main features": "Thanh điều hướng và các tính năng chính",
  "View and save your courses easily": "Xem và lưu khóa học một cách dễ dàng",
  "Dig into a course": "Tìm hiểu về một khóa học",
  "Find courses using the search feature": "Tìm kiếm khóa học bằng tính năng tìm kiếm",
  "Get recommendation for you": "Nhận gợi ý lộ trình học cho bạn",
  "Thanks for using our website": "Cảm ơn bạn đã sử dụng ứng dụng của chúng tôi",
  "Please give us your feedback": "Hãy cho chúng tôi biết ý kiến của bạn",
  "Your account information have been saved!": "Thông tin tài khoản của bạn đã được lưu!",
  "Your goal careers": "Mục tiêu nghề nghiệp của bạn",
  "Your current careers": "Nghề nghiệp hiện tại",
  "optional": "tùy chọn",
  "Your current skills": "Các kỹ năng hiện tại của bạn",
  "Your current skills may change when you update your current career": "Các kỹ năng hiện tại của bạn có thể thay đổi khi bạn cập nhật nghề nghiệp hiện tại",
  "Your goal skills": "Các kỹ năng bạn muốn đạt được",
  "Recommend for me now": "Gợi ý cho tôi",
  "At least one skill is required": "Yêu cầu ít nhất một kỹ năng",
  "Tell us about your skills": "Thông tin về các kỹ năng của bạn",
  "Keyword": "Từ khóa",
  "Learning path": "Lộ trình học",
  "Not learned": "Chưa tham gia",
  "Learn status": "Trạng thái học tập",
  "Is there any career that you already have?": "Bạn đã đạt được nghề nghiệp nào chưa?",
  "Checking profile! Please wait for a moment!": "Đang kiểm tra thông tin hồ sơ! Vui lòng đợi một chút!",
  "You don't have any goal career": "Bạn chưa có mục tiêu nghề nghiệp nào",
  "You don't have any current career": "Bạn chưa có nghề nghiệp hiện tại nào",
  "You don't have any learned or hope framework": "Bạn chưa có khung phần mềm nào",
  "You don't have any learned or hope knowledge": "Bạn chưa có kiến thức nền nào",
  "You don't have any learned or hope platform": "Bạn chưa có nền tảng nào",
  "You don't have any learned or hope programming language": "Bạn chưa có ngôn ngữ lập trình nào",
  "You don't have any learned or hope tool": "Bạn chưa có công cụ nào",
  "Get user guide": "Nhận hướng dẫn sử dụng",
  "Sorry, we currently do not have any courses suitable for you. Please try again later.": "Xin lỗi, hiện tại chúng tôi không có khóa học phù hợp với bạn. Vui lòng thử lại sau.",
  "Close": "Đóng",
  "Cancel": "Hủy",
  "Backend Developer": "Nhà phát triển Backend",
  "Business Analyst": "Chuyên viên phân tích kinh doanh",
  "Data Analysts": "Chuyên viên phân tích dữ liệu",
  "Data Engineer": "Kỹ sư dữ liệu",
  "Data Scientist": "Khoa học dữ liệu",
  "Database Administrator": "Quản trị Cơ sở dữ liệu",
  "Devops Engineer": "Kỹ sư DevOps",
  "Frontend Developer": "Nhà phát triển Frontend",
  "Game Development": "Phát triển Game",
  "Mobile Developer": "Nhà phát triển ứng dụng di động",
  "Network Engineer": "Kỹ sư mạng",
  "Software Architect": "Kiến trúc sư phần mềm",
  "Tester": "Kiểm thử phần mềm",
  "UX/UI Designer": "Thiết kế UX/UI",
  "Tip: Selecting skills will help us to generate better": "Mẹo: Chọn kỹ năng sẽ giúp chúng tôi tạo ra lộ trình học tốt hơn",
  "We are ready to get you some courses": "Chúng tôi đã sẵn sàng gợi ý cho bạn một số khóa học",
  "Provided by": "Cung cấp bởi",
  "No courses": "Không có khóa học",
  "No skills": "Không có kỹ năng"
}
